DROP DATABASE IF EXISTS university;
CREATE DATABASE university collate utf16_general_ci;
USE university;

CREATE TABLE faculty
(
	id INT NOT NULL auto_increment,
	fclt_name VARCHAR(30) NOT NULL,
    PRIMARY KEY (id)
);

INSERT INTO faculty(fclt_name)
	VALUES
		('РТФ'),
		('ФУП'),
		('ФИВТ');

CREATE TABLE squad
(
	id INT NOT NULL auto_increment,
	sqd_name VARCHAR(30) NOT NULL,
    headman VARCHAR(30) NOT NULL,
    sqd_faculty INT NOT NULL,
    FOREIGN KEY (sqd_faculty) REFERENCES faculty (id),
    PRIMARY KEY (id)
);

INSERT INTO squad(sqd_name, headman, sqd_faculty)
	VALUES
		('УТС', 'Иванов', 1),
		('ЭиН', 'Шарапов', 1),
		('РСК', 'Карпов', 1),
		('ГМУ', 'Скляренко', 2),
		('ТД', 'Ефимов', 2),
		('УП', 'Беляков', 2),
		('ПС', 'Терентьев', 3),
		('БИС', 'Горбачёв', 3),
		('ИВТ', 'Негода', 3);



CREATE TABLE students
(
	id INT NOT NULL auto_increment,
    name VARCHAR(30) NOT NULL,
    last_name VARCHAR(30) NOT NULL,
    age INT NOT NULL,
    std_squad INT NOT NULL, 
    FOREIGN KEY (std_squad) REFERENCES squad (id),
    PRIMARY KEY (id)
);

INSERT INTO students(name, last_name, age, std_squad) 
	VALUES
		('Иван','Иванов', 17, 1),
		('Артемий','Дидовец', 18, 1),
		('Тимур','Каськив', 18, 1),
		('Григорий','Носов', 19, 1),
		('Николай','Мишин', 20, 1),
		('Сергей ','Шарапов', 17, 2),
		('Владимир','Афанасьев', 18, 2),
		('Святослав','Посидайло', 19, 2),
		('Спартак','Котовский', 20, 2),
		('Чеслав','Стрелков', 21, 2),
		('Геннадий','Карпов', 17, 3),
		('Абрам','Давыдов', 18, 3),
		('Пётр','Фокин', 19, 3),
		('Карл','Муравьёв', 20, 3),
		('Святослав','Громов', 17, 3),
		('Игнат','Скляренко', 18, 4),
		('Бронислав','Выговский', 19, 4),
		('Йомер','Герасимов', 20, 4),
		('Трофим','Зайцев', 17, 4),
		('Артемий','Морозов', 18, 4),
		('Емельян','Ефимов', 19, 5),
		('Жерар','Гончар', 20, 5),
		('Никодим','Миклашевский', 21, 5),
		('Фёдор','Полищук', 17, 5),
		('Йошка','Виноградов', 18, 5),
		('Эрик','Беляков', 19, 6),
		('Фёдор','Рогов', 20, 6),
		('Илья','Острожский', 17, 6),
		('Ярослав','Захаров', 18, 6),
		('Павел','Буров', 19, 6),
		('Бронислав','Терентьев', 20, 7),
		('Богдан','Кулаков', 17, 7),
		('Фёдор','Кличко', 18, 7),
		('Шарль','Хитрук', 19, 7),
		('Мирослав','Панфилов', 20, 7),
		('Юлиан','Горбачёв', 17, 8),
		('Зураб','Уваров', 18, 8),
		('Йомер','Панфилов', 19, 8),
		('Валерий','Савин', 20, 8),
		('Харитон','Захарченко', 19, 8),
		('Харитон','Негода', 17, 9),
		('Эрик','Третьяков', 18, 9),
		('Даниил','Сидоров', 20, 9),
		('Устин','Евдокимов', 17, 9),
		('Шерлок','Калинин', 18, 9);

